{
  "0": "Expected plain text root first child to be a ParagraphNode",
  "1": "Expected rich text root first child to be a ParagraphNode",
  "2": "createOffsetModel: could not find node by key",
  "3": "getNodesInRange: first node does not have parent",
  "4": "getNodesInRange: no common ancestor",
  "5": "getNodesInRange: excludeFromCopy node does not have non-excluded parent",
  "6": "getNodesInRange: node is not a block node",
  "7": "getNodesInRange: child is not inside parent",
  "8": "insertText: first node is not a text node",
  "9": "updateDOM: prevInnerDOM is null or undefined",
  "10": "updateDOM: innerDOM is null or undefined",
  "11": "setFormat: can only be used on non-immutable nodes",
  "12": "setStyle: can only be used on non-immutable nodes",
  "13": "setTextContent: can only be used on non-immutable text nodes",
  "14": "spliceText: can only be used on non-immutable text nodes",
  "15": "spliceText: selection not found",
  "16": "splitText: can only be used on non-immutable text nodes",
  "17": "decorate: base method not extended",
  "18": "OutlineNode: Node type %s does not implement .clone().",
  "19": "Expected node %s to have a parent.",
  "20": "Expected node %s to have a parent block.",
  "21": "Expected node %s to have a top parent block.",
  "22": "getNodesBetween: ancestor is null",
  "23": "getLatest: node not found",
  "24": "createDOM: base method not extended",
  "25": "updateDOM: base method not extended",
  "26": "setFlags: can only be used on non-immutable nodes",
  "27": "Expected node with key %s to exist but it's not in the nodeMap.",
  "28": "createNodeFromParse: type \"%s\" + not found",
  "29": "select: cannot be called on root nodes",
  "30": "remove: cannot be called on root nodes",
  "31": "replace: cannot be called on root nodes",
  "32": "insertBefore: cannot be called on root nodes",
  "33": "insertAfter: cannot be called on root nodes",
  "34": "rootNode.append: Only block nodes can be appended to the root node",
  "35": "setViewModel: the view model is empty. Ensure the view model's root node never becomes empty.",
  "36": "Editor.update() cannot be used within a text node transform.",
  "37": "Cannot use method in read-only mode.",
  "38": "Unable to find an active view model. View methods or node methods can only be used synchronously during the callback of editor.update() or viewModel.read().",
  "39": "Unable to find an active editor. View methods or node methods can only be used synchronously during the callback of editor.update() or viewModel.read().",
  "40": "updateEditor: the pending view model is empty. Ensure the root not never becomes empty from an update.",
  "41": "updateEditor: selection has been lost because the previously selected nodes have been removed and selection wasn't moved to another node. Ensure selection changes after removing/replacing a selected node.",
  "42": "Point.getNode: node not found",
  "43": "createNode: node does not exist in nodeMap",
  "44": "reconcileNode: prevNode or nextNode does not exist in nodeMap",
  "45": "reconcileNode: parentDOM is null",
  "46": "Reconciliation: could not find DOM element for node key \"${key}\"",
  "47": "clearEditor expected plain text root first child to be a ParagraphNode",
  "48": "Editor.getLatestTextContent() can be asynchronous and cannot be used within Editor.update()",
  "49": "insertNodes: cannot insert node after, target is null"
}
