{
  "0": "LexicalComposerContext.useLexicalComposerContext: cannot find a LexicalComposerContext",
  "1": "insertAfter: list node is not parent of list item node",
  "2": "A ListItemNode must have a ListNode for a parent.",
  "3": "createOffsetModel: could not find node by key",
  "4": "decorate: base method not extended",
  "5": "Point.getNode: node not found",
  "6": "insertText: first node is not a text node",
  "7": "insertNodes: cannot insert a non-element into a root node",
  "8": "insertNodes: cloned parent clone is not an element",
  "9": "select: cannot be called on root nodes",
  "10": "remove: cannot be called on root nodes",
  "11": "replace: cannot be called on root nodes",
  "12": "insertBefore: cannot be called on root nodes",
  "13": "insertAfter: cannot be called on root nodes",
  "14": "rootNode.append: Only element nodes can be appended to the root node",
  "15": "Expected node %s to have a first child.",
  "16": "Node is not a child of its parent",
  "17": "Register node type: Type %s in node %s was already registered by another node %s",
  "18": "Node %s has not been registered. Run editor.registerNode to register your own nodes.",
  "19": "setEditorState: the editor state is empty. Ensure the editor state's root node never becomes empty.",
  "20": "updateDOM: prevInnerDOM is null or undefined",
  "21": "updateDOM: innerDOM is null or undefined",
  "22": "mergeWithSibling: sibling must be a previous or next sibling",
  "23": "registeredNode: Type %s not found",
  "24": "createNodeFromParse: type \"%s\" + not found",
  "25": "Cannot use method in read-only mode.",
  "26": "One or more transforms are endlessly triggering additional transforms. May have encountered infinite recursion caused by transforms that have their preconditions too lose and/or conflict with each other.",
  "27": "Unable to find an active editor state. State helpers or node methods can only be used synchronously during the callback of editor.update() or editorState.read().",
  "28": "Unable to find an active editor. This method can only be used synchronously during the callback of editor.update().",
  "29": "updateEditor: the pending editor state is empty. Ensure the root not never becomes empty from an update.",
  "30": "updateEditor: selection has been lost because the previously selected nodes have been removed and selection wasn't moved to another node. Ensure selection changes after removing/replacing a selected node.",
  "31": "LexicalNode: Node %s does not implement .getType().",
  "32": "LexicalNode: Node %s does not implement .clone().",
  "33": "Expected node %s to have a parent.",
  "34": "Expected node %s to have a top parent element.",
  "35": "getNodesBetween: ancestor is null",
  "36": "getLatest: node not found",
  "37": "createDOM: base method not extended",
  "38": "updateDOM: base method not extended",
  "39": "Expected node with key %s to exist but it's not in the nodeMap.",
  "40": "Create node: Attempted to create node %s that was not previously registered on the editor. You can use editor.registerNode to register your custom nodes.",
  "41": "Create node: Type %s in node %s does not match registered node %s with the same type",
  "42": "createNode: node does not exist in nodeMap",
  "43": "reconcileNode: prevNode or nextNode does not exist in nodeMap",
  "44": "reconcileNode: parentDOM is null",
  "45": "Reconciliation: could not find DOM element for node key \"${key}\""
}
