{
  "0": "OutlineController.useController: cannot find matching OutlineController",
  "1": "OutlineEditorContext.useEditorContext: cannot find matching OutlineEditorContext",
  "2": "insertAfter: list node is not parent of list item node",
  "3": "createOffsetModel: could not find node by key",
  "4": "A ListItemNode must have a ListNode for a parent.",
  "5": "insertNodes: cannot insert a non-block into a root node",
  "6": "insertNodes: cloned parent clone is not a block",
  "7": "insertText: first node is not a text node",
  "8": "Register node type: Type %s in node %s was already registered by another node %s",
  "9": "Node %s has not been registered. Run editor.registerNode to register your own nodes.",
  "10": "setEditorState: the editor state is empty. Ensure the editor state's root node never becomes empty.",
  "11": "updateDOM: prevInnerDOM is null or undefined",
  "12": "updateDOM: innerDOM is null or undefined",
  "13": "setFormat: can only be used on non-immutable nodes",
  "14": "setStyle: can only be used on non-immutable nodes",
  "15": "setTextContent: can only be used on non-immutable text nodes",
  "16": "spliceText: can only be used on non-immutable text nodes",
  "17": "spliceText: selection not found",
  "18": "splitText: can only be used on non-immutable text nodes",
  "19": "select: cannot be called on root nodes",
  "20": "remove: cannot be called on root nodes",
  "21": "replace: cannot be called on root nodes",
  "22": "insertBefore: cannot be called on root nodes",
  "23": "insertAfter: cannot be called on root nodes",
  "24": "rootNode.append: Only block nodes can be appended to the root node",
  "25": "registeredNode: Type %s not found",
  "26": "Point.getNode: node not found",
  "27": "decorate: base method not extended",
  "28": "createNodeFromParse: type \"%s\" + not found",
  "29": "OutlineNode: Node %s does not implement .getType().",
  "30": "OutlineNode: Node %s does not implement .clone().",
  "31": "Expected node %s to have a parent.",
  "32": "Expected node %s to have a parent block.",
  "33": "Expected node %s to have a top parent block.",
  "34": "getNodesBetween: ancestor is null",
  "35": "getLatest: node not found",
  "36": "createDOM: base method not extended",
  "37": "updateDOM: base method not extended",
  "38": "setFlags: can only be used on non-immutable nodes",
  "39": "Expected node with key %s to exist but it's not in the nodeMap.",
  "40": "Create node: Attempted to create node %s that was not previously registered on the editor. You can use editor.registerNode to register your custom nodes.",
  "41": "Create node: Type %s in node %s does not match registered node %s with the same type",
  "42": "Cannot use method in read-only mode.",
  "43": "Unable to find an active editor state. State helpers or node methods can only be used synchronously during the callback of editor.update() or editorState.read().",
  "44": "Unable to find an active editor. This method can only be used synchronously during the callback of editor.update().",
  "45": "One or more transforms are endlessly triggering additional transforms. May have encountered infinite recursion caused by transforms that have their preconditions too lose and/or conflict with each other.",
  "46": "updateEditor: the pending editor state is empty. Ensure the root not never becomes empty from an update.",
  "47": "updateEditor: selection has been lost because the previously selected nodes have been removed and selection wasn't moved to another node. Ensure selection changes after removing/replacing a selected node.",
  "48": "createNode: node does not exist in nodeMap",
  "49": "reconcileNode: prevNode or nextNode does not exist in nodeMap",
  "50": "reconcileNode: parentDOM is null",
  "51": "Reconciliation: could not find DOM element for node key \"${key}\"",
  "52": "insertNodes: cannot insert a non-element into a root node",
  "53": "insertNodes: cloned parent clone is not an element",
  "54": "rootNode.append: Only element nodes can be appended to the root node",
  "55": "Expected node %s to have a parent element.",
  "56": "Expected node %s to have a top parent element."
}
